Revit 2027 API
TableSectionData.IsAcceptableParamIdAndCategoryId(Int32, ElementId, ElementId) Method
 Identifies if the given parameter id and category id can be assigned to a cell in the given row in this table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAcceptableParamIdAndCategoryId(
	int nRow,
	ElementId paramId,
	ElementId categoryId
)
Public Function IsAcceptableParamIdAndCategoryId (
	nRow As Integer,
	paramId As ElementId,
	categoryId As ElementId
) As Boolean
public:
bool IsAcceptableParamIdAndCategoryId(
	int nRow,
	ElementId^ paramId,
	ElementId^ categoryId
)
member IsAcceptableParamIdAndCategoryId :
        nRow : int *
        paramId : ElementId *
        categoryId : ElementId -> bool
Parameters
nRow Int32
 row index
paramId ElementId
categoryId ElementId
Return Value
Boolean
 True if the ParamId and CategoryId are all valid.
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableSectionData Class
IsAcceptableParamIdAndCategoryId Overload
Autodesk.Revit.DB Namespace